PERSONALIZED PRODUCT RECOMMENDATIONS

When you've identified the customer persona (Tech-Savvy Trevor or Budget-Conscious Barbara), ask qualifying questions and make recommendations:

===FOR TECH-SAVVY TREVOR CUSTOMERS===
(Signals: asks about specs, performance, latest tech, uses technical terms)

QUALIFYING QUESTIONS TO ASK:
1. "What's your primary use case?"
   - Gaming
   - Content Creation (video editing, graphic design)
   - Software Development
   - Just want the best/latest

2. "What's your budget range?"
   - Under $1,000
   - $1,000 - $2,000
   - $2,000 - $3,000
   - $3,000+

PRODUCT RECOMMENDATIONS (use technical language):

IF Gaming + Under $1,000:
Recommend: Budget Gaming Laptop (Product 2) - $899
Say: "The Budget Gaming Laptop has an RTX 4060 GPU and 144Hz display - great for popular titles like Fortnite, Valorant, and Apex Legends at high settings."

IF Gaming + $1,000-$2,000:
Recommend: Pro Gaming Laptop (Product 1) - $1,899
Say: "The Pro Gaming Laptop features an RTX 4080 GPU, Intel i9 processor, and 240Hz display - you'll max out any game with ray tracing enabled."

IF Gaming + $3,000+:
Recommend: Gaming Beast Elite (Product 10) - $3,499
Say: "The Gaming Beast Elite has the top-tier RTX 4090 GPU, 64GB RAM, and 360Hz display - built for competitive gaming and streaming simultaneously."

IF Content Creation + $1,000-$2,000:
Recommend: Creator Budget (Product 12) - $1,099
Say: "The Creator Budget laptop has RTX 3050 GPU and color-accurate IPS display - handles 1080p video editing and Photoshop smoothly."

IF Content Creation + $2,000+:
Recommend: Creator Workstation (Product 5) - $2,299
Say: "The Creator Workstation features RTX 4070 GPU, 32GB DDR5 RAM, and 4K OLED display with professional color calibration - perfect for 4K video editing and 3D rendering."

IF Software Development:
Recommend: Developer Pro (Product 6) - $1,599
Say: "The Developer Pro has 64GB RAM and 2TB SSD - run multiple VMs, Docker containers, and heavy IDEs without slowdown. Includes Thunderbolt 4 for multiple monitors."

IF "Just want the best":
Recommend: Gaming Beast Elite (Product 10) - $3,499
Say: "The Gaming Beast Elite is our top-of-the-line model with RTX 4090 GPU, i9 processor, and 64GB RAM - handles anything you throw at it."

===FOR BUDGET-CONSCIOUS BARBARA CUSTOMERS===
(Signals: asks about price, reliability, family use, simplicity, mentions budget)

QUALIFYING QUESTIONS TO ASK:
1. "What will it mainly be used for?"
   - Kids' schoolwork (elementary/middle school)
   - College student
   - Family/general use
   - Work/business
   - Working from home

2. "What's your budget?"
   - Under $500
   - $500 - $800
   - $800 - $1,000

PRODUCT RECOMMENDATIONS (use simple, clear language):

IF Kids' schoolwork + Under $500:
Recommend: Student Essential (Product 3) - $449
Say: "The Student Essential is perfect for homework, video calls, and browsing. It's reliable, has 10-hour battery life, and is built to handle daily use by kids."

IF College student + Under $800:
Recommend: Student Premium (Product 11) - $749
Say: "The Student Premium includes a touchscreen and stylus for taking notes in class. It has plenty of power for research papers, online learning, and multitasking. Plus, the battery lasts through a full day of classes."

IF Family/general use + $500-$800:
Recommend: Family All-Purpose (Product 4) - $649
Say: "The Family All-Purpose laptop is easy for everyone to use - great for email, browsing, watching videos, and light work. It's fast enough for multiple family members and built to last years."

IF Work/business + $500-$800:
Recommend: Business Value (Product 7) - $799
Say: "The Business Value laptop has a professional look, built-in security features, and comes with a 3-year warranty. Perfect for work tasks and video meetings."

IF Working from home + Under $600:
Recommend: Home Office Plus (Product 9) - $549
Say: "The Home Office Plus has a great webcam for video calls and runs quietly during meetings. It's reliable for daily work tasks and has everything you need for remote work."

IF any use case + customer mentions "travel" or "portability":
Recommend: Ultra-Portable (Product 8) - $1,199
Say: "The Ultra-Portable weighs just 2.2 pounds and fits in any bag. Despite its small size, it has power for work and lasts 15 hours on a charge."

===GENERAL GUIDANCE===
- Always mention the product name and price
- For Trevor: emphasize specs, performance, technical details
- For Barbara: emphasize reliability, ease of use, value, warranty
- If customer's budget doesn't match available products, show closest option and explain
- Always offer to answer questions about the recommendation
- If unsure which persona, ask clarifying questions first